[
  [
    {
      "description": "Data Loading — Load the dataset from 'http://127.0.0.1:5000/dataset/rotor.vti' using vtkXMLImageDataReader."
    },
    {
      "description": "Data Processing — Set the active scalar array to 'Pressure' and compute the slice index at 95% depth along the Y-axis using the dataset's dimensions, then apply vtkImageSlice to extract the slice."
    },
    {
      "description": "Visualization Setup — Configure a color transfer function with a blue-to-white-to-red gradient spanning the full range of 'Pressure' scalar values and assign it to the vtkImageMapper for rendering."
    },
    {
      "description": "Opacity Configuration — Set the opacity to fully opaque (value 1.0) across all pressure values with no transparency variation."
    },
    {
      "description": "UI Components — Add an orientation marker with XYZ axes in the bottom-right corner of the render window using vtkOrientationMarkerWidget."
    },
    {
      "description": "Rendering — Initialize the render window, renderer, and interactor to display the sliced volume with the configured color map and orientation marker."
    }
  ],
  [
    {
      "description": "Data Loading — Load the Deepwater dataset from 'http://127.0.0.1:5000/dataset/deepwater.vti' using vtkXMLImageDataReader."
    },
    {
      "description": "Data Processing — Compute the velocity magnitude from arrays 'v02' and 'v03' using vtkCalculator; if either array is unavailable, use 'prs' as the scalar field."
    },
    {
      "description": "Isosurface Generation — Generate an isosurface at the mid-value of the computed scalar range using vtkContourTriangulator or vtkImageMarchingCubes."
    },
    {
      "description": "Color Mapping — Apply a blue → white → red color map spanning the full scalar range (min to max) using vtkColorTransferFunction for the isosurface."
    },
    {
      "description": "Surface Rendering — Configure the isosurface to be fully opaque with smooth shading using vtkMapper and appropriate property settings."
    },
    {
      "description": "Orientation Marker — Add an XYZ orientation marker in the bottom-right corner of the render window using vtkOrientationMarkerWidget."
    },
    {
      "description": "Rendering — Initialize the render window, renderer, and interactor to display the isosurface with the orientation marker."
    }
  ],
  [
    {
      "description": "Data Loading — Load the Isabel dataset from 'http://127.0.0.1:5000/dataset/isabel.vti' using vtkXMLImageDataReader."
    },
    {
      "description": "Data Processing — Extract the 'Velocity' vector array as the flow field for streamline computation."
    },
    {
      "description": "Seed Generation — Generate a dense grid of seed points at the center of the dataset to ensure full domain coverage for streamline integration."
    },
    {
      "description": "Streamline Computation — Compute streamlines using the velocity field and seed points via vtkImageStreamline."
    },
    {
      "description": "Streamline Rendering — Render streamlines with cyan color ([0, 1, 1]) and a specified line width using vtkMapper and vtkGlyph3DMapper."
    },
    {
      "description": "Outline Generation — Generate a bounding box outline of the dataset using vtkOutlineFilter."
    },
    {
      "description": "Outline Rendering — Render the dataset outline in red ([1, 0, 0]) with a specified line width using vtkMapper."
    },
    {
      "description": "Rendering Setup — Configure the render window, renderer, and interactor to display both streamlines and outline simultaneously."
    }
  ],
  [
    {
      "description": "Data Loading — Load the dataset from 'http://127.0.0.1:5000/dataset/redsea.vti' using vtkXMLImageDataReader."
    },
    {
      "description": "Data Processing — Compute the velocity magnitude from the 'velocity' array using vtkCalculator and set it as the active scalar."
    },
    {
      "description": "Volume Rendering Setup — Configure volume rendering using vtkVolumeMapper with a piecewise opacity function that maps scalar values to transparency."
    },
    {
      "description": "Color Mapping — Apply a blue → white → red color transfer function to the volume mapper, spanning the full scalar range from minimum to maximum velocity magnitude."
    },
    {
      "description": "Volume Appearance — Set shading, ambient, diffuse, and specular properties for realistic volume rendering using vtkVolumeProperty."
    },
    {
      "description": "Camera Configuration — Adjust the camera to look along the +Z axis and center on the dataset bounds."
    },
    {
      "description": "Rendering — Initialize the render window, renderer, and interactor to display the volume-rendered dataset."
    }
  ]
]